[
	{
		"file": "experiments/example.js",
		"name": "Name of your experiment",
		"description": "Explains the what and the why. What is the main idea? What is the purpose? Describes the coding process and implementation choices and gives a high level system overview."
	},

	{
		"file": "experiments/noise1_alternative_01.js",
		"name": "color changing lines",
		"description": "This first week I got inspired by noise_01.js file and lecture number 2 by Bassima during the live coding examples. I got the idea to try adding two more lines and make them switch random color."
	},

	{
		"file": "experiments/noise1_alternative_02.js",
		"name": "Moving lines",
		"description": "For this version I added yet another line and added movenemt with noiseSeed(); a frameRate(); and counter. I also kept the color changing from the first version."
	},

	{
		"file": "experiments/molnar_alternative_01.js",
		"name": "Molanar squares, but with random colors",
		"description": "For this work I got inspiration from multiple artists. Which will become apparrent in the later versions. The molnar example from lecture 3, live coding with Bassima, Portfolio example from Evellin Miyamoto, and one of my classmates, Kacper Paska. I wanted to see how the squares would look like on a white background but with random colors added to the stroke."
	},

	{
		"file": "experiments/molnar_alternative_02.js",
		"name": "Shifting colors",
		"description": "For this next variation I wanted to see how it would look like with more strokes in each square and random colors to the strokes. However, I added more layerse to each generated square to see how it would look."
	},

	{
		"file": "experiments/molnar_alternative_03.js",
		"name": "Moving shapes with random individual stroke colors",
		"description": "For this variation of Molnar I took inspiration from my classmate Kacper Paska. He played around with the shape and colors in his molnar variation. I wanted to try that without copying his work. So I made a different shape and added random colors to each individual stroke."
	}
]
