[
	{
		"file": "experiments/noise1_alternative_01.js",
		"name": "Color changing lines",
		"description": "This first week I got inspired by noise_01.js file and lecture number 2 by Bassima during the live coding examples. I got the idea to try adding two more lines and make them switch random color."
	},

	{
		"file": "experiments/noise1_alternative_02.js",
		"name": "Moving lines",
		"description": "For this version I added yet another line and added movenemt with noiseSeed(); a frameRate(); and counter. I also kept the color changing from the first version."
	},

	{
		"file": "experiments/molnar_alternative_01.js",
		"name": "Molanar squares, but with random colors",
		"description": "For this work I got inspiration from multiple artists. Which will become apparrent in the later versions. But for this first version, I got inspired by the molnar example from lecture 3, live coding with Bassima. I wanted to see how the squares would look like on a white background but with random colors added to the stroke."
	},

	{
		"file": "experiments/molnar_alternative_02.js",
		"name": "Shifting colors",
		"description": "For this variation of Molnar, I took inspiration from the portfolio example from Evellin Miyamoto. However, compared to her example, I wanted to see how it would look like if I added more layers to each generated quare and keep the random colors to the strokes."
	},

	{
		"file": "experiments/molnar_alternative_03.js",
		"name": "Moving shapes with random individual stroke colors",
		"description": "For this variation of Molnar, I took inspiration from my classmate Kacper Paska. He played around with the shape and colors in his molnar variation. I wanted to try that without copying his work. So I made a different shape and added random colors to each individual stroke."
	},

	{
		"file": "experiments/flow-field1_alternative_01.js",
		"name": "Arrowed flow field",
		"description": "For this variation of flow field I took inspiration from the lecture CC Complexity by Bassima and the flow field example 1 by Garritt. I wanted to see how much I could change the shape of the arrows while still keep it as a flow field. Because it was suppose to be a bit more advanced, I also added random colors, and a counter and rotationSpeed to make the arrows rotate on it's axis"
	},

	{
		"file": "experiments/flow-field2_alternative_02.js",
		"name": "Lined flow field",
		"description": "For this variation of flow field I took inspiration from the lecture CC Complexity by Bassima and the flow field example 2 by Garritt. I experimented with changing the values and numbers to see how it would affect the flow field. Additionally, I added random color to it to the stroke to make it more colorful."
	},

	{
		"file": "experiments/flow-field1_sound-alternative-03.js",
		"name": "Sound flow field",
		"description": "For this variation of flow field I took inspiration from my classmate Kacper Paska. He added movement to one of his art pieces by making it react to his mouse, making it more interactive. I wanted to see if I could add that to my flowfield variation too."
	},

	{
		"file": "experiments/flow-field1_sound-alternative-01.js",
		"name": "Sound flow field",
		"description": "For this variation of flow field I used the previous flow field that reacts to the mouse to also add sound from Tone.js."
	}
]
